{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 22, "output_dim": 400, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_4", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 5000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 5000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 5000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 2500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 68, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["dense_17", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["dense_18", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.009999999776482582, "decay": 0.0, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of103.bin", "group1-shard2of103.bin", "group1-shard3of103.bin", "group1-shard4of103.bin", "group1-shard5of103.bin", "group1-shard6of103.bin", "group1-shard7of103.bin", "group1-shard8of103.bin", "group1-shard9of103.bin", "group1-shard10of103.bin", "group1-shard11of103.bin", "group1-shard12of103.bin", "group1-shard13of103.bin", "group1-shard14of103.bin", "group1-shard15of103.bin", "group1-shard16of103.bin", "group1-shard17of103.bin", "group1-shard18of103.bin", "group1-shard19of103.bin", "group1-shard20of103.bin", "group1-shard21of103.bin", "group1-shard22of103.bin", "group1-shard23of103.bin", "group1-shard24of103.bin", "group1-shard25of103.bin", "group1-shard26of103.bin", "group1-shard27of103.bin", "group1-shard28of103.bin", "group1-shard29of103.bin", "group1-shard30of103.bin", "group1-shard31of103.bin", "group1-shard32of103.bin", "group1-shard33of103.bin", "group1-shard34of103.bin", "group1-shard35of103.bin", "group1-shard36of103.bin", "group1-shard37of103.bin", "group1-shard38of103.bin", "group1-shard39of103.bin", "group1-shard40of103.bin", "group1-shard41of103.bin", "group1-shard42of103.bin", "group1-shard43of103.bin", "group1-shard44of103.bin", "group1-shard45of103.bin", "group1-shard46of103.bin", "group1-shard47of103.bin", "group1-shard48of103.bin", "group1-shard49of103.bin", "group1-shard50of103.bin", "group1-shard51of103.bin", "group1-shard52of103.bin", "group1-shard53of103.bin", "group1-shard54of103.bin", "group1-shard55of103.bin", "group1-shard56of103.bin", "group1-shard57of103.bin", "group1-shard58of103.bin", "group1-shard59of103.bin", "group1-shard60of103.bin", "group1-shard61of103.bin", "group1-shard62of103.bin", "group1-shard63of103.bin", "group1-shard64of103.bin", "group1-shard65of103.bin", "group1-shard66of103.bin", "group1-shard67of103.bin", "group1-shard68of103.bin", "group1-shard69of103.bin", "group1-shard70of103.bin", "group1-shard71of103.bin", "group1-shard72of103.bin", "group1-shard73of103.bin", "group1-shard74of103.bin", "group1-shard75of103.bin", "group1-shard76of103.bin", "group1-shard77of103.bin", "group1-shard78of103.bin", "group1-shard79of103.bin", "group1-shard80of103.bin", "group1-shard81of103.bin", "group1-shard82of103.bin", "group1-shard83of103.bin", "group1-shard84of103.bin", "group1-shard85of103.bin", "group1-shard86of103.bin", "group1-shard87of103.bin", "group1-shard88of103.bin", "group1-shard89of103.bin", "group1-shard90of103.bin", "group1-shard91of103.bin", "group1-shard92of103.bin", "group1-shard93of103.bin", "group1-shard94of103.bin", "group1-shard95of103.bin", "group1-shard96of103.bin", "group1-shard97of103.bin", "group1-shard98of103.bin", "group1-shard99of103.bin", "group1-shard100of103.bin", "group1-shard101of103.bin", "group1-shard102of103.bin", "group1-shard103of103.bin"], "weights": [{"name": "dense_13_1/kernel", "shape": [8800, 5000], "dtype": "float32"}, {"name": "dense_13_1/bias", "shape": [5000], "dtype": "float32"}, {"name": "dense_14_1/kernel", "shape": [5000, 5000], "dtype": "float32"}, {"name": "dense_14_1/bias", "shape": [5000], "dtype": "float32"}, {"name": "dense_15_1/kernel", "shape": [5000, 5000], "dtype": "float32"}, {"name": "dense_15_1/bias", "shape": [5000], "dtype": "float32"}, {"name": "dense_16_1/kernel", "shape": [5000, 2500], "dtype": "float32"}, {"name": "dense_16_1/bias", "shape": [2500], "dtype": "float32"}, {"name": "dense_17_1/kernel", "shape": [2500, 500], "dtype": "float32"}, {"name": "dense_17_1/bias", "shape": [500], "dtype": "float32"}, {"name": "dense_18_1/kernel", "shape": [500, 68], "dtype": "float32"}, {"name": "dense_18_1/bias", "shape": [68], "dtype": "float32"}, {"name": "embedding_4_1/embeddings", "shape": [22, 400], "dtype": "float32"}]}]}